Revit 2027 API
StairsPath.DownText Property
 The stairs down text.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DownText { get; set; }
Public Property DownText As String
	Get
	Set
public:
property String^ DownText {
	String^ get ();
	void set (String^ value);
}
member DownText : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: The type of this stairs path is not automatic up/down direction. -or- When setting this property: The stairs path doesn't show down text so the data being set is inapplicable.
See Also
Reference
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace